In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
l = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(l)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [5]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female','Male','Female']}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [6]:
"""
A DataFrame is a 2-dimensional labeled data structure in pandas that consists of rows and columns, similar to a table in a 
relational database or a spreadsheet. It is a primary object in pandas and is used for data manipulation and analysis. 
It can store different types of data and can be seen as a collection of Pandas Series.

A Series, on the other hand, is a one-dimensional labeled array-like structure in pandas. It can be thought of as a single 
column of a DataFrame. It can store data of homogeneous or heterogeneous data types.

In simpler terms, a DataFrame is a tabular data structure that can hold multiple columns of potentially different data types, 
while a Series is a single column of data.
"""

'\nA DataFrame is a 2-dimensional labeled data structure in pandas that consists of rows and columns, similar to a table in a \nrelational database or a spreadsheet. It is a primary object in pandas and is used for data manipulation and analysis. \nIt can store different types of data and can be seen as a collection of Pandas Series.\n\nA Series, on the other hand, is a one-dimensional labeled array-like structure in pandas. It can be thought of as a single \ncolumn of a DataFrame. It can store data of homogeneous or heterogeneous data types.\n\nIn simpler terms, a DataFrame is a tabular data structure that can hold multiple columns of potentially different data types, \nwhile a Series is a single column of data.\n'

In [7]:
# Creating a Series
series = pd.Series([10, 20, 30, 40, 50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [11]:
# 1.head() and tail(): These functions allow you to view the first or last few rows of the DataFrame, respectively. They are useful for quickly inspecting the data.
df = pd.read_csv('taxonomy.csv.xls')
df

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [12]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [13]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

In [14]:
# 2.info(): This function provides a summary of the DataFrame, including the number of non-null values and data types of each column. It helps in understanding the structure and data types of the DataFrame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290 entries, 0 to 289
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   taxonomy_id  290 non-null    object
 1   name         290 non-null    object
 2   parent_id    279 non-null    object
 3   parent_name  279 non-null    object
dtypes: object(4)
memory usage: 9.2+ KB

In [15]:
# 3.describe(): This function calculates various summary statistics of the numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, and maximum values. It provides a quick overview of the distribution of the data.
df.describe()

       taxonomy_id          name  parent_id       parent_name
count          290           290        279               279
unique         290           183         60                50
top            101  Nursing Home  106-06-07  Health Education
freq             1             4         11                15

In [18]:
# 4.sort_values(): This function sorts the DataFrame based on one or more columns. It is useful for ordering the data in a specific way.
df.sort_values('name')

      taxonomy_id                    name  parent_id           parent_name
73      106-01-01                 12-Step     106-01  Addiction & Recovery
210  108-07-09-01                 12-Step  108-07-09        Support Groups
72         106-01    Addiction & Recovery        106                Health
275     111-01-01  Adoption & Foster Care     111-01  Advocacy & Legal Aid
168        108-01  Adoption & Foster Care        108                  Care
..            ...                     ...        ...                   ...
213     108-07-10         Virtual Support     108-07       Support Network
110  106-06-04-06            Vision Tests  106-06-04        Checkup & Test
254           110                    Work        NaN                   NaN
285     111-01-07        Workplace Rights     111-01  Advocacy & Legal Aid
272        110-05        Workplace Rights        110                  Work

[290 rows x 4 columns]

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [19]:
"""
In Pandas, both Series and DataFrame are mutable in nature. This means that you can modify their values, add or remove rows 
and columns, and perform various data manipulations on them after they are created.
"""

'\nIn Pandas, both Series and DataFrame are mutable in nature. This means that you can modify their values, add or remove rows \nand columns, and perform various data manipulations on them after they are created.\n'

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])

data = {'Name': name_series, 'Age': age_series}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35